{"keras_version": "2.0.7", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "dtype": "float32", "batch_input_shape": [null, 5, 141], "scale": true, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.3, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.3, "bias_regularizer": null, "units": 64, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "implementation": 0, "activation": "tanh", "go_backwards": false, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "unit_forget_bias": true, "return_sequences": false, "kernel_regularizer": null, "stateful": false, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "activation": "softmax"}}]}